---
kind: method
id: M:Autodesk.Revit.UI.IFCExternalServiceUIData.Dispose
source: html/2858a307-6873-ea62-cc88-14e5651c28e1.htm
---
# Autodesk.Revit.UI.IFCExternalServiceUIData.Dispose Method

Releases all resources used by the IFCExternalServiceUIData

## Syntax (C#)
```csharp
public void Dispose()
```